// ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
// Immediate Invoked Function Expression
// То есть это Function Expression, к-й моментально выполняется
// Вся идея сводится к тому, что посути мы можем создавать определённые ф-ии
// к-е будут моментально вызваны
// И зачастую они используются для создания какого-то локального scope'а 
// Обычно окружены () и посути они вызываются моментально
// ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
let result = [];
// for (var i = 0; i < 5; i++) {
// 	result.push( function() {
// 		console.log(i);
// 	} );
// }

// result[1](); // 5
for (var i = 0; i < 5; i++) {
	(function() {
		var j = i;
		result.push( function() {
			console.log(j);
		} );
	})()
}

result[0](); // 0
result[1](); // 1
result[2](); // 2
result[3](); // 3
result[4](); // 4